benchmarks/results/load-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: benchmarks/load.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 28 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m01.0s/1m0s

running (0m02.0s), 10/10 VUs, 65 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m02.0s/1m0s

running (0m03.0s), 10/10 VUs, 103 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m03.0s/1m0s

running (0m04.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m04.0s/1m0s

running (0m05.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m05.0s/1m0s

running (0m06.0s), 10/10 VUs, 217 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m06.0s/1m0s

running (0m07.0s), 10/10 VUs, 253 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m07.0s/1m0s

running (0m08.0s), 10/10 VUs, 292 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m08.0s/1m0s

running (0m09.0s), 10/10 VUs, 331 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m09.0s/1m0s

running (0m10.0s), 10/10 VUs, 367 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m10.0s/1m0s

running (0m11.0s), 10/10 VUs, 407 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m11.0s/1m0s

running (0m12.0s), 10/10 VUs, 445 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m12.0s/1m0s

running (0m13.0s), 10/10 VUs, 484 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m13.0s/1m0s

running (0m14.0s), 10/10 VUs, 521 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m14.0s/1m0s

running (0m15.0s), 10/10 VUs, 559 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m15.0s/1m0s

running (0m16.0s), 10/10 VUs, 597 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m16.0s/1m0s

running (0m17.0s), 10/10 VUs, 636 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m17.0s/1m0s

running (0m18.0s), 10/10 VUs, 673 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m18.0s/1m0s

running (0m19.0s), 10/10 VUs, 711 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m19.0s/1m0s

running (0m20.0s), 10/10 VUs, 750 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m20.0s/1m0s

running (0m21.0s), 10/10 VUs, 788 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  0m21.0s/1m0s

running (0m22.0s), 10/10 VUs, 824 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m22.0s/1m0s

running (0m23.0s), 10/10 VUs, 864 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  0m23.0s/1m0s

running (0m24.0s), 10/10 VUs, 901 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  0m24.0s/1m0s

running (0m25.0s), 10/10 VUs, 940 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m25.0s/1m0s

running (0m26.0s), 10/10 VUs, 978 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  0m26.0s/1m0s

running (0m27.0s), 10/10 VUs, 1016 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  0m27.0s/1m0s

running (0m28.0s), 10/10 VUs, 1055 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m28.0s/1m0s

running (0m29.0s), 10/10 VUs, 1088 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  0m29.0s/1m0s

running (0m30.0s), 10/10 VUs, 1125 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  0m30.0s/1m0s

running (0m31.0s), 10/10 VUs, 1165 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  0m31.0s/1m0s

running (0m32.0s), 10/10 VUs, 1203 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  0m32.0s/1m0s

running (0m33.0s), 10/10 VUs, 1242 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  0m33.0s/1m0s

running (0m34.0s), 10/10 VUs, 1278 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  0m34.0s/1m0s

running (0m35.0s), 10/10 VUs, 1314 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  0m35.0s/1m0s

running (0m36.0s), 10/10 VUs, 1353 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  0m36.0s/1m0s

running (0m37.0s), 10/10 VUs, 1390 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  0m37.0s/1m0s

running (0m38.0s), 10/10 VUs, 1429 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  0m38.0s/1m0s

running (0m39.0s), 10/10 VUs, 1467 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  0m39.0s/1m0s

running (0m40.0s), 10/10 VUs, 1504 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  0m40.0s/1m0s

running (0m41.0s), 10/10 VUs, 1543 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  0m41.0s/1m0s

running (0m42.0s), 10/10 VUs, 1582 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  0m42.0s/1m0s

running (0m43.0s), 10/10 VUs, 1619 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  0m43.0s/1m0s

running (0m44.0s), 10/10 VUs, 1655 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  0m44.0s/1m0s

running (0m45.0s), 10/10 VUs, 1694 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  0m45.0s/1m0s

running (0m46.0s), 10/10 VUs, 1733 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  0m46.0s/1m0s

running (0m47.0s), 10/10 VUs, 1772 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  0m47.0s/1m0s

running (0m48.0s), 10/10 VUs, 1809 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  0m48.0s/1m0s

running (0m49.0s), 10/10 VUs, 1847 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  0m49.0s/1m0s

running (0m50.0s), 10/10 VUs, 1878 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  0m50.0s/1m0s

running (0m51.0s), 10/10 VUs, 1911 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  0m51.0s/1m0s

running (0m52.0s), 10/10 VUs, 1946 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  0m52.0s/1m0s

running (0m53.0s), 10/10 VUs, 1986 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  0m53.0s/1m0s

running (0m54.0s), 10/10 VUs, 2023 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  0m54.0s/1m0s

running (0m55.0s), 10/10 VUs, 2062 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  0m55.0s/1m0s

running (0m56.0s), 10/10 VUs, 2099 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  0m56.0s/1m0s

running (0m57.0s), 10/10 VUs, 2138 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  0m57.0s/1m0s

running (0m58.0s), 10/10 VUs, 2177 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  0m58.0s/1m0s

running (0m59.0s), 10/10 VUs, 2216 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  0m59.0s/1m0s

running (1m00.0s), 10/10 VUs, 2251 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<600' p(95)=40.71ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2263    37.573434/s
    checks_succeeded...: 100.00% 2263 out of 2263
    checks_failed......: 0.00%   0 out of 2263

    ✓ bootstrap returns 201
    ✓ seed ticket returns 201
    ✓ ticket read returns 200
    ✓ ticket create returns 201
    ✓ organization read returns 200

    HTTP
    http_req_duration..............: avg=14.33ms  min=3.47ms   med=8.01ms   max=228.91ms p(90)=26.34ms  p(95)=40.71ms  p(99)=86.98ms 
      { expected_response:true }...: avg=14.33ms  min=3.47ms   med=8.01ms   max=228.91ms p(90)=26.34ms  p(95)=40.71ms  p(99)=86.98ms 
    http_req_failed................: 0.00%  0 out of 2263
    http_reqs......................: 2263   37.573434/s

    EXECUTION
    iteration_duration.............: avg=265.66ms min=253.95ms med=259.45ms max=480.48ms p(90)=277.89ms p(95)=292.42ms p(99)=346.01ms
    iterations.....................: 2261   37.540227/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 3.2 MB 53 kB/s
    data_sent......................: 687 kB 11 kB/s



running (1m00.2s), 00/10 VUs, 2261 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s